БухЭксп/InformationRegisters/CW_ХарактеристикиДоговоровИПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиДоговоровИПриложений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныДоговоров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграниченСпискомЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставДаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_ДополнительныеХарактиристикиДоговоровСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ИспользуютсяДополнительныеХарактеристики = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяДополнительныеХарактеристикиДоговоровИПриложений"); 
	Если Не ИспользуютсяДополнительныеХарактеристики Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Параметры = Форма.Параметры;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ЗаполнитьСписокДополнительныхХарактеристик(Форма, Объект.Ссылка);
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗаполнитьСписокДополнительныхХарактеристик(Форма, Параметры.ЗначениеКопирования);
	КонецЕсли;
	
	Форма.ЗаписатьПараметрыВРегистр = Истина;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	ИспользуютсяДополнительныеХарактеристики = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяДополнительныеХарактеристикиДоговоровИПриложений"); 
	Если Не ИспользуютсяДополнительныеХарактеристики Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Если Форма.ЗаписатьПараметрыВРегистр Тогда
		РегистрыСведений.CW_ХарактеристикиДоговоровИПриложений.ЗаписатьЗначенияПараметровВРегистр(Объект.Ссылка, Форма.ДополнительныеХарактеристики.Выгрузить());
		Форма.ЗаписатьПараметрыВРегистр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокДополнительныхХарактеристик(Форма, Ссылка)
	
	ТаблицаХарактеристик = РегистрыСведений.CW_ХарактеристикиДоговоровИПриложений.ПолучитьХарактиристикиОбъекта(Ссылка);
	Форма.ДополнительныеХарактеристики.Загрузить(ТаблицаХарактеристик);
	
	Для Каждого СтрокаТаблицы из Форма.ДополнительныеХарактеристики Цикл
		СтрокаТаблицы.СоставДаты = ПолучитьСоставДатыСтроки(СтрокаТаблицы.Параметр.ТипЗначения.КвалификаторыДаты.ЧастиДаты);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписокПараметровПоШаблону(Форма, Перезаполнить) Экспорт
	
	ДанныеДляСогласования =  Справочники.CW_ШаблоныДоговоров.ПолучитьСписокПараметров(Форма.Объект.ШаблонДоговора); 
	Если Перезаполнить Тогда
		Форма.ДополнительныеХарактеристики.Загрузить(ДанныеДляСогласования);
	Иначе
		кэшТаблицы = Форма.ДополнительныеХарактеристики.Выгрузить();
		Форма.ДополнительныеХарактеристики.Очистить();
		
		Для Каждого СтрокаШаблона из  ДанныеДляСогласования Цикл
			НоваяСтрока = Форма.ДополнительныеХарактеристики.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаШаблона);
			
			мСтроки = кэшТаблицы.НайтиСтроки(Новый Структура("Параметр",НоваяСтрока.Параметр));
			Если мСтроки.Количество() > 0 Тогда
				кэшСтрока = мСтроки[0];
				ЗаполнитьЗначенияСвойств(НоваяСтрока,кэшСтрока);
				кэшТаблицы.Удалить(кэшСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Если кэшТаблицы.Количество() > 0 Тогда
			//Что-то осталось
			Для Каждого кэшСтрока из  кэшТаблицы Цикл
				НоваяСтрока = Форма.ДополнительныеХарактеристики.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,кэшСтрока);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.ЗаписатьПараметрыВРегистр = Истина;
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, Отказ) Экспорт
	
	Для Каждого СтрокаХарактеристик из Форма.ДополнительныеХарактеристики Цикл
		Если Не ЗначениеЗаполнено(СтрокаХарактеристик.Параметр) Тогда
			ИндексСтроки = Форма.ДополнительныеХарактеристики.Индекс(СтрокаХарактеристик);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран параметр!",,"ДополнительныеХарактеристики["+Формат(ИндексСтроки,"ЧГ=0")+"].Параметр",, Отказ);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнительныеХарактеристикиПараметрПриИзменении(Форма) Экспорт
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;  
	
	УстановитьСвязиПараметровВыбора(Форма);
	
	ИдентификаторСтроки = Элементы.ДополнительныеХарактеристики.ТекущаяСтрока;
	ТекущаяСтрока 		= Форма.ДополнительныеХарактеристики.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ПараметрыОтбора = Новый Структура("Параметр", ТекущаяСтрока.Параметр);
	мСтроки = Форма.ДополнительныеХарактеристики.НайтиСтроки(ПараметрыОтбора);
	
	Если мСтроки.Количество() > 1 Тогда
		ТекущаяСтрока.Параметр = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный параметр уже есть в списке!");
	Иначе
		Если ЗначениеЗаполнено(ТекущаяСтрока.Параметр) Тогда
			ОбработатьДанныеСтроки(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры 

Процедура УстановитьСвязиПараметровВыбора(Форма) Экспорт
	
	Элементы 			= Форма.Элементы;
	ИдентификаторСтроки = Элементы.ДополнительныеХарактеристики.ТекущаяСтрока;
	ТекущаяСтрока 		= Форма.ДополнительныеХарактеристики.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Параметр.ТипЗначения.СодержитТип(Тип("СправочникСсылка.CW_ДополнительныеЗначенияПараметровГрузоперевозок")) Тогда
		СвязьПараметровВыбора =  Новый СвязьПараметраВыбора("Отбор.Владелец",	"Элементы.ДополнительныеХарактеристики.ТекущиеДанные.Параметр");
		Массив = новый Массив;
		Массив.Добавить(СвязьПараметровВыбора);
		СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);  
	Иначе
		Массив = новый Массив;
		СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);  
	КонецЕсли;
	
	Элементы.ДополнительныеХарактеристикиЗначение.СвязиПараметровВыбора = СвязиПараметровВыбора;                                           
	
КонецПроцедуры

Процедура ОбработатьДанныеСтроки(ТекущаяСтрока) Экспорт
	
	Параметр = ТекущаяСтрока.Параметр;
	Значение = ТекущаяСтрока.Значение;
	
	ТекущаяСтрока.Значение = Параметр.ТипЗначения.ПривестиЗначение(Значение); 
	
	Если Параметр.ЭтоКонтрольнаяДата Тогда
		ТекущаяСтрока.ИндексКартинки = 2;
	ИначеЕсли Параметр.ДинамическийПараметр Тогда
		ТекущаяСтрока.ИндексКартинки = 3;
	Иначе
		ТекущаяСтрока.ИндексКартинки = 1;
	КонецЕсли;
	
	ТекущаяСтрока.СоставДаты 				= ПолучитьСоставДатыСтроки(Параметр.ТипЗначения.КвалификаторыДаты.ЧастиДаты);
	ТекущаяСтрока.ОграниченСпискомЗначений 	= Параметр.ОграниченСпискомЗначений;
	
КонецПроцедуры

Функция ПолучитьСоставДатыСтроки(КлассификаторДаты) Экспорт
	
	Если КлассификаторДаты = ЧастиДаты.Время Тогда
		Возврат 1;
	ИначеЕсли КлассификаторДаты = ЧастиДаты.ДатаВремя Тогда
		Возврат 2;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ТребуетсяЗаполнениеДополнительныхХарактеристик(Результат) Экспорт
	
	Результат.Вставить("ЗаполнитьДополнительныеХарактеристики", ПолучитьФункциональнуюОпцию("CW_ИспользуютсяДополнительныеХарактеристикиДоговоровИПриложений"));
	
КонецПроцедуры

Функция ПолучитьСписокВыбораПараметра(Форма) Экспорт
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	ИдентификаторСтроки = Элементы.ДополнительныеХарактеристики.ТекущаяСтрока;
	ТекущаяСтрока 		= Форма.ДополнительныеХарактеристики.НайтиПоИдентификатору(ИдентификаторСтроки);
	Параметр 			= ТекущаяСтрока.Параметр;
	
	Если Параметр.ОграниченСпискомЗначений Тогда
		мДоступноеЗначение = Параметр.ДоступныеЗначения.ВыгрузитьКолонку("ДоступноеЗначение");
		Возврат мДоступноеЗначение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
